Repository: VBog/Bg-Highlight-Names
Catalog: languages/*-highlight-names-*.po
Languages: ru_ru

source: The maximum execution time (%1$s sec.) could not be set. System limits the maximum execution time of %2$s sec.
ru_ru: Максимальное время (%1$s сек.) работы скрипта установить не удалось. Максимальное время, установленное в системе: %2$s сек.

source: Plugin's &#171;Highlight Names&#187; settings
ru_ru: Настройки плагина &#171;Подсветка имён&#187;

source: Highlight names
ru_ru: Подсветка имён

source: XML-file without comment.
ru_ru: XML-файл без описания.

source: Error while XML-file uploading.
ru_ru: Ошибка загрузки XML-файла.

source: is not correct database file.
ru_ru: - это не корректный файл базы данных.

source: - XML-file not exist.
ru_ru: - XML-файл не существует.

source: Processing has not yet completed. Please wait.
ru_ru: Обработки еще не завершена. Подождите, пожалуйста.

source: Nothing more to process.
ru_ru: Больше нечего обрабатывать.

source: Updated %1$d page or post!
ru_ru: Обновлена %1$d страница или пост!

source: Tested %1$d of %2$d names in %3$.1f seconds.
ru_ru: Проверено %1$d из %2$d имён за %3$.1f сек.

source: Successfully tested all %1$d names in %2$.1f seconds.
ru_ru: Успешно проверены все %1$d имён за %2$.1f сек.

source: Version
ru_ru: Версия

source: Settings
ru_ru: Настройки

source: Data
ru_ru: Данные

source: Batch mode
ru_ru: Пакетный режим

source: Plugin mode
ru_ru: Режим работы плагина

source: online
ru_ru: онлайн

source: (In this mode the plugin highlights the names only when text displays on the screen.)
ru_ru: (В этом режиме плагин выделяет имена лишь тогда, когда текст отображается на экране.)

source: offline
ru_ru: оффлайн

source: (This mode makes permanent changes in the text in editor mode.)
ru_ru: (Этот режим делает постоянные изменения в тексте в режиме редактора).

source: mixed
ru_ru: смешанный

source: (Mixing online & offline mode. Highlight the names when text displays on the screen, only if the text doesn't include links for names.)
ru_ru: (Смесь онлайн и в оффлайн режимов. Подсвечивает имена, когда текст отображается на экране, только если текст не включает в себя ссылки на имена.)

source: clear
ru_ru: очистка

source: (Removes links to the names from the text in editor and batch modes.)
ru_ru: (Удаляет ссылки на имена из текста в режиме редактора и пакетном режиме.)

source: off
ru_ru: выкл.

source: (The plugin does not work (batch mode only).)
ru_ru: (Плагин не работает (только пакетный режим).)

source: Limit the amount of links per person
ru_ru: Ограничение количество ссылок на человека

source: (0 - no limits).
ru_ru: (0 - без ограничений).

source: The minimum number of chars between two links to one person
ru_ru: Минимальное количество символов между двумя ссылками на одного человека

source: Where open links?
ru_ru: Где открывать ссылки?

source: in blank window
ru_ru: в новом окне

source: in self window
ru_ru: в текущем окне

source: or any other window name
ru_ru: или любое другое имя окна

source: Additional class for links
ru_ru: Дополнительный класс для ссылок

source: The maximum execution time
ru_ru: Максимальное время работы плагина

source: sec.
ru_ru: сек.

source: Show debug info at the end of the post
ru_ru: Отображать отладочную информацию в конце поста

source: Save Changes
ru_ru: Сохранить изменения

source: Current XML-file
ru_ru: Текущий XML-файл

source: default
ru_ru: по умолчанию

source: Upload XML-file
ru_ru: Загрузить XML-файл

source: Select file
ru_ru: Выберите файл

source: Upload
ru_ru: Загрузить

source: Really upload the file?
ru_ru: Действительно загрузить этот файл?

source: XML-file uploaded.
ru_ru: XML-файл загружен.

source: No response.
ru_ru: Нет ответа.

source: Custom XML-file with names list
ru_ru: Пользовательский XML-файл со списком имен

source: (Specify a local URL of XML-file that contain the names to highlight them in text. <br> Leave blank to use the XML-file by default.)
ru_ru: (Укажите локальный URL XML-файла, содержащего имена для подсветки в тексте статей.<br>Оставьте поле пустым, чтобы использовать XML-файл по умолчанию.)

source: XML-file changed. Don\'t forget save settings.
ru_ru: XML-файл изменён. Не забудьте сохранить настройки.

source: XML-file set to default. Don\'t forget save settings.
ru_ru: XML-файл установлен по умолчанию. Не забудьте сохранить настройки.

source: XML-files and Excel templates on
ru_ru: XML-файлы и шаблоны Excel на

source: Download XML schema:
ru_ru: Скачать схему XML-файла:

source: How to create the XML with names list read
ru_ru: О создании XML-файла имён читайте

source: How to create and edit of XML-file in Excel is written in
ru_ru: Создание и редактирование XML-файла в Excel описано в

source: this article
ru_ru: этой статье

source: Batch mode<br>(depend on plugin mode)
ru_ru: Пакетный режим<br>(зависит от режима плагина)

source: Parse posts: start #
ru_ru: Обработать посты: от №

source: finish #
ru_ru: до №

source: Do not clean before parsing
ru_ru: Не очищать перед обработкой

source: Note: New links will be added to the existing ones.
ru_ru: Обратите внимание: Новые ссылки будут добавлены к существующим.

source: Parse posts
ru_ru: Обработать посты

source: (It makes permanent changes in the text of all pages and posts.) <br><b>We strongly recommend to keep your SQL-database dump.</b>
ru_ru: (Делает постоянные изменения в текст всех страниц и сообщений). <br> <b>Мы настоятельно рекомендуем сохранить дамп SQL-базы данных.</b>

source: Don't close or update this tab. Parsing in progress!<br>Wait, please.
ru_ru: Не закрывайте и не обновляйте эту вкладку. Идет процесс обработки статей! <br> Подождите, пожалуйста.

source: Don't forget save options before start of batch mode!
ru_ru: Не забудьте сохранить настройки перед началом пакетного режима!

source: For detail of results see:
ru_ru: Подробно результаты обработки см.:

source: You had reloaded this tab. Sorry, but you can not watch the process here. Check the log file to see the result of parsing. When the process is completed, just reload the tab again.<br>To interrupt the process, deactivate and then activate the plugin on the plugins page.
ru_ru: Вы перезагрузили эту вкладку. Сожалеем, но Вы не можете наблюдать за ходом процесса здесь. Проверьте файл журнала, чтобы увидеть результат парсинга. Когда процесс завершится, просто перезагрузите эту вкладку снова.<br>Чтобы прервать процесс, деактивируйте и вновь активируйте плагин на странице Плагинов.

source: Adds links in pages and posts where the links don't yet added only
ru_ru: Добавляет ссылки только на страницы и в посты, где ссылки ещё не были добавлены

source: Removes and then adds links in all pages and posts
ru_ru: Удаляет и затем добавляет ссылки во всех страницах и постах

source: Removes links from all pages and posts
ru_ru: Удаляет ссылки со всех страниц и постов

source: Adds links in all pages and posts
ru_ru: Добавляет ссылки во все страницы и посты

source: Really begin highlight names in all posts and pages in batch mode?
ru_ru: Начать подсветку имен всех постах и страницах в пакетном режиме?

source: Fatal error:
ru_ru: Критическая ошибка:

source: Try again...
ru_ru: Попробуем ещё раз...

source: Process aborted.
ru_ru: Обработка прервана.

source: Warning:
ru_ru: Предупреждение:

source: Highlight Russian names in text of posts and pages.
ru_ru: Подсвечивает русские имена в тексте сообщений и страниц.
